app/views/articles/show.html.erb

      <div class="user-info center">
          <small><%= pluralize(@article.user.articles.count,"article")  %></small>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 16]]


  <% if @article.categories.any?%>
---
SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT ?  [["article_id", 4], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ?  [["article_id", 4]]