app/views/users/index.html.erb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 16]]
SELECT COUNT(*) FROM "users"
---
            <li><strong><%= user.email%></strong></li>
            <li id="user-footer"><small><%= pluralize(user.articles.count,"article") if user.articles %></small></li>