app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

  def create
    # render plain: params[:article].inspect
    # @article.save
    @article = Article.new (article_params)
    @article.user = User.first
    if @article.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ojdoqwdkoweko"], ["description", "odkwoekdweokfowekfokefokefew\r\n"], ["created_at", "2018-04-03 01:10:30.163544"], ["updated_at", "2018-04-03 01:10:30.163544"], ["user_id", 23]]

  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "hvhjjhdgkkk"], ["description", "conooo claro que si manooooojghjghjghjghjghgjhjghjgjhghjghjgjhgjhg"], ["updated_at", "2018-03-30 05:08:19.082664"], ["id", 8]]