app/controllers/categories_controller.rb

  def index
    @categories = Category.paginate(page: params[:page], per_page: 5)
---
SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"

  def show
    @category = Category.find(params[:id])
    @category_articles = @category.articles.paginate(page: params[:page], per_page: 5)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 4], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 4]]

  def update
    @category = Category.find(params[:id])
    if @category.update(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Sportssssssssss"], ["updated_at", "2018-04-11 04:53:04.554047"], ["id", 4]]