app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 4)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    # render plain: params[:article].inspect
    # @user.save
    @user = User.new (user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 2)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 17]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 16]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "elpep1234@gmail.com"], ["password_digest", "$2a$10$YJH0UeeckoFDmDUPSaOc6.pUUyQQ29RVHh6/nAtfMx2lwra11if5m"], ["updated_at", "2018-04-01 09:46:01.375144"], ["id", 2]]