app/views/categories/index.html.erb

SELECT "categories".* FROM "categories"
---

  <% Category.all.each do |category|%>

SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 4]]
---
          <div align="center">
            <small ><%= pluralize(category.articles.count, "article")%></small>